{
  "jobs": [
    {
      "id": 1,
      "title": "Junior Frontend Developer",
      "type": "Part Time",
      "description": "Join our dynamic team to build responsive and interactive web interfaces using HTML, CSS, and JavaScript. Collaborate with senior developers and gain hands-on experience in modern frontend frameworks.",
      "salary": "$50-60k/year",
      "location": "Nepal"
    },
    {
      "id": 2,
      "title": "Backend Developer",
      "type": "Full Time",
      "description": "Work on server-side applications and APIs using Node.js, Express, and databases. Optimize performance, ensure security, and collaborate with the frontend team to deliver seamless applications.",
      "salary": "$60-70k/year",
      "location": "Remote"
    },
    {
      "id": 3,
      "title": "UI/UX Designer",
      "type": "Contract",
      "description": "Design user-friendly interfaces and experiences for web and mobile apps. Create wireframes, mockups, and prototypes, and work closely with developers to implement your designs.",
      "salary": "$40-50k/year",
      "location": "Nepal"
    },
    {
      "id": 4,
      "title": "Full Stack Developer",
      "type": "Full Time",
      "description": "Develop complete web applications using both frontend and backend technologies. Manage databases, APIs, and user interfaces to build efficient and scalable solutions.",
      "salary": "$70-90k/year",
      "location": "Remote"
    },
    {
      "id": 5,
      "title": "DevOps Engineer",
      "type": "Full Time",
      "description": "Implement CI/CD pipelines, monitor system performance, and manage cloud infrastructure. Work closely with development teams to ensure smooth deployments and scalability.",
      "salary": "$80-100k/year",
      "location": "Remote"
    },
    {
      "id": 6,
      "title": "Data Analyst",
      "type": "Full Time",
      "description": "Analyze large datasets to generate actionable insights. Work with SQL, Excel, and data visualization tools to support business decisions.",
      "salary": "$55-65k/year",
      "location": "Nepal"
    },
    {
      "id": 7,
      "title": "Mobile App Developer",
      "type": "Contract",
      "description": "Build and maintain mobile applications for iOS and Android using React Native or Flutter. Collaborate with designers and backend developers to deliver high-quality apps.",
      "salary": "$60-75k/year",
      "location": "Remote"
    },
    {
      "id": 8,
      "title": "QA Engineer",
      "type": "Full Time",
      "description": "Test web and mobile applications, create automated test scripts, and ensure software quality. Work closely with developers to identify and fix bugs.",
      "salary": "$50-65k/year",
      "location": "Nepal"
    },
    {
      "id": 9,
      "title": "Cloud Solutions Architect",
      "type": "Full Time",
      "description": "Design and implement scalable cloud architectures on AWS, Azure, or Google Cloud. Ensure reliability, security, and cost-effectiveness of cloud solutions.",
      "salary": "$90-120k/year",
      "location": "Remote"
    },
    {
      "id": 10,
      "title": "Technical Writer",
      "type": "Part Time",
      "description": "Create clear and concise documentation for software applications, APIs, and user guides. Collaborate with developers and product managers to ensure accuracy.",
      "salary": "$35-45k/year",
      "location": "Nepal"
    }
  ]
}
